<?php

$a = $_GET['a'] ?? 4;
$b = $_GET['b'] ?? 12;
$c = $_GET['c'] ?? 4;

//вычисляем дискриминант
$d = $b * $b - 4 * $a * $c;

//вычисляем x1 и x2 с округлением (функция round) до тысячных
// $x1 = round(($b * (-1) + sqrt($d)) / (2 * $a), 3);
// $x2 = round(($b * (-1) - sqrt($d)) / (2 * $a), 3);

if ($d > 0) {
   $x1 = round(($b * (-1) + sqrt($d)) / (2 * $a), 3);
   $x2 = round(($b * (-1) - sqrt($d)) / (2 * $a), 3);
} else if ($d == 0) {
   $x1 = round(($b * (-1)) / (2 * $a), 3);
   $x2 = 'Дискриминант равен 0, второго корня нет';
} else {
   $x1 = 'Корней нет';
   $x2 = 'Корней нет';
}

include "template.php";
