<?php

// $a = $_GET['a'] ?? 0;
// $b = $_GET['b'] ?? 0;
// $c = $_GET['c'] ?? 0;
$a = 4;
$b = 12;
$c = 4;

//вычисляем дискриминант
$d = $b * $b - 4 * $a * $c;

//вычисляем x1 и x2 с округлением (функция round) до десятых
$x1 = round(($b * (-1) + sqrt($d)) / (2 * $a), 1);
$x2 = round(($b * (-1) - sqrt($d)) / (2 * $a), 1);

// if ($d < 0) {
//    $x = 'Решений нет';
// } elseif ($d == 0) {
//    $x = round(($b * (-1) / (2 * $a)), 1);
// } 
// else ($d > 0) {
//    $x1 = round(($b * (-1) + sqrt($d)) / (2 * $a), 1);
//    $x2 = round(($b * (-1) - sqrt($d)) / (2 * $a), 1);
// }

include "template_quad.php";
